[01HGDN76QHK92ZDA5ZBYGSGJQZ] Planning changes with 1 custom hook...
data.aws_ami.server_ami: Reading...
data.aws_ami.server_ami: Read complete after 1s [id=ami-0a588942e90cfecc9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dev_node will be created
  + resource "aws_instance" "dev_node" {
      + ami                                  = "ami-0a588942e90cfecc9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "Dev"
          + "Name"        = "ExampleInstance"
        }
      + tags_all                             = {
          + "Environment" = "Dev"
          + "Name"        = "ExampleInstance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "315436d8a3399146b37d7460990773856beae69b"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_internet_gateway.mtc_internet_gateway will be created
  + resource "aws_internet_gateway" "mtc_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "mtc_igw"
        }
      + tags_all = {
          + "Name" = "mtc_igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.mtc_auth will be created
  + resource "aws_key_pair" "mtc_auth" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "mtckey2"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpyqbN5YjL9KJbjECZ5XabhMdmp/sZOZKkcu7qMtalRDBQU7IHKrgsECXsHSrbmI393VUXgL8qnYMq6XHYVEK8u+D70pXuZaKoTYRyvnwaRbXm324RiyBjInfUVLOGN3x+dkZ2PSSm3G71AVQT6zJVHd2drESyNSYZkITI8XfmuZqTnXOtkfK/cYwnljy4hghN6uC+aTc5F40o8pfXRZMdeE/263pmBtYaWF15/iSp0lO+SAuRYXRevGj0icKLelLSU6X+OrnlVJrxXbxFsfou3CSyY5fN61jSLjQete/O4TLBl0pac5TqBlqUCQQ5kw9OMbk0n47f/jJmn4yQphEbz7Ob0vPm01O+hsLgWpUkrTlROfWy0b9WaoelbakSbdDUvJq9ha8Xh/iPeShszE8ymuItL/NSOJEJw7W4uriULouRg2GmKFQ96zFoAjfAh4z+igDh1fCJCDcC5CjsV9LbsMoxQ/FNZAFcvOWXnQBUkVEGmvkyoeIg8HfFmWv2Hes= daniellemurphy@Danielles-MacBook-Air.local"
      + tags_all        = (known after apply)
    }

  # aws_route.default_route will be created
  + resource "aws_route" "default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.mtc_public_rt will be created
  + resource "aws_route_table" "mtc_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev_public_rt"
        }
      + tags_all         = {
          + "Name" = "dev_public_rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.mtc_public_assoc will be created
  + resource "aws_route_table_association" "mtc_public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.mtc_sg will be created
  + resource "aws_security_group" "mtc_sg" {
      + arn                    = (known after apply)
      + description            = "public security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.mtc_public_subnet will be created
  + resource "aws_subnet" "mtc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.123.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-public"
        }
      + tags_all                                       = {
          + "Name" = "dev-public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.mtc_vpc will be created
  + resource "aws_vpc" "mtc_vpc" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.123.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = true
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags                           = {
          + "Name" = "dev2"
        }
      + tags_all                       = {
          + "Name" = "dev2"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dev_ip = (known after apply)
{"format_version":"1.2","terraform_version":"1.5.7","variables":{"host_os":{"value":"linux"}},"planned_values":{"outputs":{"dev_ip":{"sensitive":false}},"root_module":{"resources":[{"address":"aws_instance.dev_node","mode":"managed","type":"aws_instance","name":"dev_node","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":1,"values":{"ami":"ami-0a588942e90cfecc9","credit_specification":[],"get_password_data":false,"hibernation":null,"iam_instance_profile":null,"instance_type":"t2.micro","launch_template":[],"source_dest_check":true,"tags":{"Environment":"Dev","Name":"ExampleInstance"},"tags_all":{"Environment":"Dev","Name":"ExampleInstance"},"timeouts":null,"user_data":"315436d8a3399146b37d7460990773856beae69b","volume_tags":null},"sensitive_values":{"capacity_reservation_specification":[],"credit_specification":[],"ebs_block_device":[],"enclave_options":[],"ephemeral_block_device":[],"ipv6_addresses":[],"launch_template":[],"metadata_options":[],"network_interface":[],"root_block_device":[],"secondary_private_ips":[],"security_groups":[],"tags":{},"tags_all":{},"vpc_security_group_ids":[]}},{"address":"aws_internet_gateway.mtc_internet_gateway","mode":"managed","type":"aws_internet_gateway","name":"mtc_internet_gateway","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":0,"values":{"tags":{"Name":"mtc_igw"},"tags_all":{"Name":"mtc_igw"}},"sensitive_values":{"tags":{},"tags_all":{}}},{"address":"aws_key_pair.mtc_auth","mode":"managed","type":"aws_key_pair","name":"mtc_auth","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":1,"values":{"key_name":"mtckey2","public_key":"ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpyqbN5YjL9KJbjECZ5XabhMdmp/sZOZKkcu7qMtalRDBQU7IHKrgsECXsHSrbmI393VUXgL8qnYMq6XHYVEK8u+D70pXuZaKoTYRyvnwaRbXm324RiyBjInfUVLOGN3x+dkZ2PSSm3G71AVQT6zJVHd2drESyNSYZkITI8XfmuZqTnXOtkfK/cYwnljy4hghN6uC+aTc5F40o8pfXRZMdeE/263pmBtYaWF15/iSp0lO+SAuRYXRevGj0icKLelLSU6X+OrnlVJrxXbxFsfou3CSyY5fN61jSLjQete/O4TLBl0pac5TqBlqUCQQ5kw9OMbk0n47f/jJmn4yQphEbz7Ob0vPm01O+hsLgWpUkrTlROfWy0b9WaoelbakSbdDUvJq9ha8Xh/iPeShszE8ymuItL/NSOJEJw7W4uriULouRg2GmKFQ96zFoAjfAh4z+igDh1fCJCDcC5CjsV9LbsMoxQ/FNZAFcvOWXnQBUkVEGmvkyoeIg8HfFmWv2Hes= daniellemurphy@Danielles-MacBook-Air.local","tags":null},"sensitive_values":{"tags_all":{}}},{"address":"aws_route.default_route","mode":"managed","type":"aws_route","name":"default_route","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":0,"values":{"carrier_gateway_id":null,"destination_cidr_block":"0.0.0.0/0","destination_ipv6_cidr_block":null,"destination_prefix_list_id":null,"egress_only_gateway_id":null,"local_gateway_id":null,"nat_gateway_id":null,"timeouts":null,"transit_gateway_id":null,"vpc_endpoint_id":null,"vpc_peering_connection_id":null},"sensitive_values":{}},{"address":"aws_route_table.mtc_public_rt","mode":"managed","type":"aws_route_table","name":"mtc_public_rt","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":0,"values":{"tags":{"Name":"dev_public_rt"},"tags_all":{"Name":"dev_public_rt"},"timeouts":null},"sensitive_values":{"propagating_vgws":[],"route":[],"tags":{},"tags_all":{}}},{"address":"aws_route_table_association.mtc_public_assoc","mode":"managed","type":"aws_route_table_association","name":"mtc_public_assoc","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":0,"values":{"gateway_id":null},"sensitive_values":{}},{"address":"aws_security_group.mtc_sg","mode":"managed","type":"aws_security_group","name":"mtc_sg","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":1,"values":{"description":"public security group","egress":[{"cidr_blocks":["0.0.0.0/0"],"description":"","from_port":0,"ipv6_cidr_blocks":[],"prefix_list_ids":[],"protocol":"-1","security_groups":[],"self":false,"to_port":0}],"ingress":[{"cidr_blocks":["0.0.0.0/0"],"description":"","from_port":22,"ipv6_cidr_blocks":[],"prefix_list_ids":[],"protocol":"tcp","security_groups":[],"self":false,"to_port":22}],"name":"public_sg","revoke_rules_on_delete":false,"tags":null,"timeouts":null},"sensitive_values":{"egress":[{"cidr_blocks":[false],"ipv6_cidr_blocks":[],"prefix_list_ids":[],"security_groups":[]}],"ingress":[{"cidr_blocks":[false],"ipv6_cidr_blocks":[],"prefix_list_ids":[],"security_groups":[]}],"tags_all":{}}},{"address":"aws_subnet.mtc_public_subnet","mode":"managed","type":"aws_subnet","name":"mtc_public_subnet","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":1,"values":{"assign_ipv6_address_on_creation":false,"cidr_block":"10.123.1.0/24","customer_owned_ipv4_pool":null,"enable_dns64":false,"enable_resource_name_dns_a_record_on_launch":false,"enable_resource_name_dns_aaaa_record_on_launch":false,"ipv6_cidr_block":null,"ipv6_native":false,"map_customer_owned_ip_on_launch":null,"map_public_ip_on_launch":true,"outpost_arn":null,"tags":{"Name":"dev-public"},"tags_all":{"Name":"dev-public"},"timeouts":null},"sensitive_values":{"tags":{},"tags_all":{}}},{"address":"aws_vpc.mtc_vpc","mode":"managed","type":"aws_vpc","name":"mtc_vpc","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":1,"values":{"assign_generated_ipv6_cidr_block":null,"cidr_block":"10.123.0.0/16","enable_dns_hostnames":true,"enable_dns_support":true,"instance_tenancy":"default","ipv4_ipam_pool_id":null,"ipv4_netmask_length":null,"ipv6_ipam_pool_id":null,"ipv6_netmask_length":null,"tags":{"Name":"dev2"},"tags_all":{"Name":"dev2"}},"sensitive_values":{"tags":{},"tags_all":{}}}]}},"resource_changes":[{"address":"aws_instance.dev_node","mode":"managed","type":"aws_instance","name":"dev_node","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"ami":"ami-0a588942e90cfecc9","credit_specification":[],"get_password_data":false,"hibernation":null,"iam_instance_profile":null,"instance_type":"t2.micro","launch_template":[],"source_dest_check":true,"tags":{"Environment":"Dev","Name":"ExampleInstance"},"tags_all":{"Environment":"Dev","Name":"ExampleInstance"},"timeouts":null,"user_data":"315436d8a3399146b37d7460990773856beae69b","volume_tags":null},"after_unknown":{"arn":true,"associate_public_ip_address":true,"availability_zone":true,"capacity_reservation_specification":true,"cpu_core_count":true,"cpu_threads_per_core":true,"credit_specification":[],"disable_api_termination":true,"ebs_block_device":true,"ebs_optimized":true,"enclave_options":true,"ephemeral_block_device":true,"host_id":true,"id":true,"instance_initiated_shutdown_behavior":true,"instance_state":true,"ipv6_address_count":true,"ipv6_addresses":true,"key_name":true,"launch_template":[],"metadata_options":true,"monitoring":true,"network_interface":true,"outpost_arn":true,"password_data":true,"placement_group":true,"placement_partition_number":true,"primary_network_interface_id":true,"private_dns":true,"private_ip":true,"public_dns":true,"public_ip":true,"root_block_device":true,"secondary_private_ips":true,"security_groups":true,"subnet_id":true,"tags":{},"tags_all":{},"tenancy":true,"user_data_base64":true,"vpc_security_group_ids":true},"before_sensitive":false,"after_sensitive":{"capacity_reservation_specification":[],"credit_specification":[],"ebs_block_device":[],"enclave_options":[],"ephemeral_block_device":[],"ipv6_addresses":[],"launch_template":[],"metadata_options":[],"network_interface":[],"root_block_device":[],"secondary_private_ips":[],"security_groups":[],"tags":{},"tags_all":{},"vpc_security_group_ids":[]}}},{"address":"aws_internet_gateway.mtc_internet_gateway","mode":"managed","type":"aws_internet_gateway","name":"mtc_internet_gateway","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"tags":{"Name":"mtc_igw"},"tags_all":{"Name":"mtc_igw"}},"after_unknown":{"arn":true,"id":true,"owner_id":true,"tags":{},"tags_all":{},"vpc_id":true},"before_sensitive":false,"after_sensitive":{"tags":{},"tags_all":{}}}},{"address":"aws_key_pair.mtc_auth","mode":"managed","type":"aws_key_pair","name":"mtc_auth","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"key_name":"mtckey2","public_key":"ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpyqbN5YjL9KJbjECZ5XabhMdmp/sZOZKkcu7qMtalRDBQU7IHKrgsECXsHSrbmI393VUXgL8qnYMq6XHYVEK8u+D70pXuZaKoTYRyvnwaRbXm324RiyBjInfUVLOGN3x+dkZ2PSSm3G71AVQT6zJVHd2drESyNSYZkITI8XfmuZqTnXOtkfK/cYwnljy4hghN6uC+aTc5F40o8pfXRZMdeE/263pmBtYaWF15/iSp0lO+SAuRYXRevGj0icKLelLSU6X+OrnlVJrxXbxFsfou3CSyY5fN61jSLjQete/O4TLBl0pac5TqBlqUCQQ5kw9OMbk0n47f/jJmn4yQphEbz7Ob0vPm01O+hsLgWpUkrTlROfWy0b9WaoelbakSbdDUvJq9ha8Xh/iPeShszE8ymuItL/NSOJEJw7W4uriULouRg2GmKFQ96zFoAjfAh4z+igDh1fCJCDcC5CjsV9LbsMoxQ/FNZAFcvOWXnQBUkVEGmvkyoeIg8HfFmWv2Hes= daniellemurphy@Danielles-MacBook-Air.local","tags":null},"after_unknown":{"arn":true,"fingerprint":true,"id":true,"key_name_prefix":true,"key_pair_id":true,"tags_all":true},"before_sensitive":false,"after_sensitive":{"tags_all":{}}}},{"address":"aws_route.default_route","mode":"managed","type":"aws_route","name":"default_route","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"carrier_gateway_id":null,"destination_cidr_block":"0.0.0.0/0","destination_ipv6_cidr_block":null,"destination_prefix_list_id":null,"egress_only_gateway_id":null,"local_gateway_id":null,"nat_gateway_id":null,"timeouts":null,"transit_gateway_id":null,"vpc_endpoint_id":null,"vpc_peering_connection_id":null},"after_unknown":{"gateway_id":true,"id":true,"instance_id":true,"instance_owner_id":true,"network_interface_id":true,"origin":true,"route_table_id":true,"state":true},"before_sensitive":false,"after_sensitive":{}}},{"address":"aws_route_table.mtc_public_rt","mode":"managed","type":"aws_route_table","name":"mtc_public_rt","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"tags":{"Name":"dev_public_rt"},"tags_all":{"Name":"dev_public_rt"},"timeouts":null},"after_unknown":{"arn":true,"id":true,"owner_id":true,"propagating_vgws":true,"route":true,"tags":{},"tags_all":{},"vpc_id":true},"before_sensitive":false,"after_sensitive":{"propagating_vgws":[],"route":[],"tags":{},"tags_all":{}}}},{"address":"aws_route_table_association.mtc_public_assoc","mode":"managed","type":"aws_route_table_association","name":"mtc_public_assoc","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"gateway_id":null},"after_unknown":{"id":true,"route_table_id":true,"subnet_id":true},"before_sensitive":false,"after_sensitive":{}}},{"address":"aws_security_group.mtc_sg","mode":"managed","type":"aws_security_group","name":"mtc_sg","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"description":"public security group","egress":[{"cidr_blocks":["0.0.0.0/0"],"description":"","from_port":0,"ipv6_cidr_blocks":[],"prefix_list_ids":[],"protocol":"-1","security_groups":[],"self":false,"to_port":0}],"ingress":[{"cidr_blocks":["0.0.0.0/0"],"description":"","from_port":22,"ipv6_cidr_blocks":[],"prefix_list_ids":[],"protocol":"tcp","security_groups":[],"self":false,"to_port":22}],"name":"public_sg","revoke_rules_on_delete":false,"tags":null,"timeouts":null},"after_unknown":{"arn":true,"egress":[{"cidr_blocks":[false],"ipv6_cidr_blocks":[],"prefix_list_ids":[],"security_groups":[]}],"id":true,"ingress":[{"cidr_blocks":[false],"ipv6_cidr_blocks":[],"prefix_list_ids":[],"security_groups":[]}],"name_prefix":true,"owner_id":true,"tags_all":true,"vpc_id":true},"before_sensitive":false,"after_sensitive":{"egress":[{"cidr_blocks":[false],"ipv6_cidr_blocks":[],"prefix_list_ids":[],"security_groups":[]}],"ingress":[{"cidr_blocks":[false],"ipv6_cidr_blocks":[],"prefix_list_ids":[],"security_groups":[]}],"tags_all":{}}}},{"address":"aws_subnet.mtc_public_subnet","mode":"managed","type":"aws_subnet","name":"mtc_public_subnet","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"assign_ipv6_address_on_creation":false,"cidr_block":"10.123.1.0/24","customer_owned_ipv4_pool":null,"enable_dns64":false,"enable_resource_name_dns_a_record_on_launch":false,"enable_resource_name_dns_aaaa_record_on_launch":false,"ipv6_cidr_block":null,"ipv6_native":false,"map_customer_owned_ip_on_launch":null,"map_public_ip_on_launch":true,"outpost_arn":null,"tags":{"Name":"dev-public"},"tags_all":{"Name":"dev-public"},"timeouts":null},"after_unknown":{"arn":true,"availability_zone":true,"availability_zone_id":true,"id":true,"ipv6_cidr_block_association_id":true,"owner_id":true,"private_dns_hostname_type_on_launch":true,"tags":{},"tags_all":{},"vpc_id":true},"before_sensitive":false,"after_sensitive":{"tags":{},"tags_all":{}}}},{"address":"aws_vpc.mtc_vpc","mode":"managed","type":"aws_vpc","name":"mtc_vpc","provider_name":"registry.terraform.io/hashicorp/aws","change":{"actions":["create"],"before":null,"after":{"assign_generated_ipv6_cidr_block":null,"cidr_block":"10.123.0.0/16","enable_dns_hostnames":true,"enable_dns_support":true,"instance_tenancy":"default","ipv4_ipam_pool_id":null,"ipv4_netmask_length":null,"ipv6_ipam_pool_id":null,"ipv6_netmask_length":null,"tags":{"Name":"dev2"},"tags_all":{"Name":"dev2"}},"after_unknown":{"arn":true,"default_network_acl_id":true,"default_route_table_id":true,"default_security_group_id":true,"dhcp_options_id":true,"enable_classiclink":true,"enable_classiclink_dns_support":true,"id":true,"ipv6_association_id":true,"ipv6_cidr_block":true,"main_route_table_id":true,"owner_id":true,"tags":{},"tags_all":{}},"before_sensitive":false,"after_sensitive":{"tags":{},"tags_all":{}}}}],"output_changes":{"dev_ip":{"actions":["create"],"before":null,"after_unknown":true,"before_sensitive":false,"after_sensitive":false}},"prior_state":{"format_version":"1.0","terraform_version":"1.5.7","values":{"root_module":{"resources":[{"address":"data.aws_ami.server_ami","mode":"data","type":"aws_ami","name":"server_ami","provider_name":"registry.terraform.io/hashicorp/aws","schema_version":0,"values":{"architecture":"x86_64","arn":"arn:aws:ec2:us-west-2::image/ami-0a588942e90cfecc9","block_device_mappings":[{"device_name":"/dev/sda1","ebs":{"delete_on_termination":"true","encrypted":"false","iops":"0","snapshot_id":"snap-069e779ea73b69a0f","throughput":"0","volume_size":"8","volume_type":"gp2"},"no_device":"","virtual_name":""},{"device_name":"/dev/sdb","ebs":{},"no_device":"","virtual_name":"ephemeral0"},{"device_name":"/dev/sdc","ebs":{},"no_device":"","virtual_name":"ephemeral1"}],"creation_date":"2023-05-31T17:00:22.000Z","description":"Canonical, Ubuntu, 18.04 LTS, amd64 bionic image build on 2023-05-31","ena_support":true,"executable_users":null,"filter":[{"name":"name","values":["ubuntu/images/hvm-ssd/ubuntu-bionic-18.04-amd64-server-*"]}],"hypervisor":"xen","id":"ami-0a588942e90cfecc9","image_id":"ami-0a588942e90cfecc9","image_location":"amazon/ubuntu/images/hvm-ssd/ubuntu-bionic-18.04-amd64-server-20230531","image_owner_alias":"amazon","image_type":"machine","kernel_id":null,"most_recent":true,"name":"ubuntu/images/hvm-ssd/ubuntu-bionic-18.04-amd64-server-20230531","name_regex":null,"owner_id":"099720109477","owners":["099720109477"],"platform":null,"platform_details":"Linux/UNIX","product_codes":[],"public":true,"ramdisk_id":null,"root_device_name":"/dev/sda1","root_device_type":"ebs","root_snapshot_id":"snap-069e779ea73b69a0f","sriov_net_support":"simple","state":"available","state_reason":{"code":"UNSET","message":"UNSET"},"tags":{},"usage_operation":"RunInstances","virtualization_type":"hvm"},"sensitive_values":{"block_device_mappings":[{"ebs":{}},{"ebs":{}},{"ebs":{}}],"filter":[{"values":[false]}],"owners":[false],"product_codes":[],"state_reason":{},"tags":{}}}]}}},"configuration":{"provider_config":{"aws":{"name":"aws","full_name":"registry.terraform.io/hashicorp/aws","expressions":{"region":{"constant_value":"us-west-2"}}}},"root_module":{"outputs":{"dev_ip":{"expression":{"references":["aws_instance.dev_node.public_ip","aws_instance.dev_node"]}}},"resources":[{"address":"aws_instance.dev_node","mode":"managed","type":"aws_instance","name":"dev_node","provider_config_key":"aws","expressions":{"ami":{"references":["data.aws_ami.server_ami.id","data.aws_ami.server_ami"]},"instance_type":{"constant_value":"t2.micro"},"key_name":{"references":["aws_key_pair.mtc_auth.id","aws_key_pair.mtc_auth"]},"subnet_id":{"references":["aws_subnet.mtc_public_subnet.id","aws_subnet.mtc_public_subnet"]},"tags":{"constant_value":{"Environment":"Dev","Name":"ExampleInstance"}},"user_data":{},"vpc_security_group_ids":{"references":["aws_security_group.mtc_sg.id","aws_security_group.mtc_sg"]}},"schema_version":1},{"address":"aws_internet_gateway.mtc_internet_gateway","mode":"managed","type":"aws_internet_gateway","name":"mtc_internet_gateway","provider_config_key":"aws","expressions":{"tags":{"constant_value":{"Name":"mtc_igw"}},"vpc_id":{"references":["aws_vpc.mtc_vpc.id","aws_vpc.mtc_vpc"]}},"schema_version":0},{"address":"aws_key_pair.mtc_auth","mode":"managed","type":"aws_key_pair","name":"mtc_auth","provider_config_key":"aws","expressions":{"key_name":{"constant_value":"mtckey2"},"public_key":{}},"schema_version":1},{"address":"aws_route.default_route","mode":"managed","type":"aws_route","name":"default_route","provider_config_key":"aws","expressions":{"destination_cidr_block":{"constant_value":"0.0.0.0/0"},"gateway_id":{"references":["aws_internet_gateway.mtc_internet_gateway.id","aws_internet_gateway.mtc_internet_gateway"]},"route_table_id":{"references":["aws_route_table.mtc_public_rt.id","aws_route_table.mtc_public_rt"]}},"schema_version":0},{"address":"aws_route_table.mtc_public_rt","mode":"managed","type":"aws_route_table","name":"mtc_public_rt","provider_config_key":"aws","expressions":{"tags":{"constant_value":{"Name":"dev_public_rt"}},"vpc_id":{"references":["aws_vpc.mtc_vpc.id","aws_vpc.mtc_vpc"]}},"schema_version":0},{"address":"aws_route_table_association.mtc_public_assoc","mode":"managed","type":"aws_route_table_association","name":"mtc_public_assoc","provider_config_key":"aws","expressions":{"route_table_id":{"references":["aws_route_table.mtc_public_rt.id","aws_route_table.mtc_public_rt"]},"subnet_id":{"references":["aws_subnet.mtc_public_subnet.id","aws_subnet.mtc_public_subnet"]}},"schema_version":0},{"address":"aws_security_group.mtc_sg","mode":"managed","type":"aws_security_group","name":"mtc_sg","provider_config_key":"aws","expressions":{"description":{"constant_value":"public security group"},"egress":{"constant_value":[{"cidr_blocks":["0.0.0.0/0"],"description":null,"from_port":0,"ipv6_cidr_blocks":null,"prefix_list_ids":null,"protocol":"-1","security_groups":null,"self":null,"to_port":0}]},"ingress":{"constant_value":[{"cidr_blocks":["0.0.0.0/0"],"description":null,"from_port":22,"ipv6_cidr_blocks":null,"prefix_list_ids":null,"protocol":"tcp","security_groups":null,"self":null,"to_port":22}]},"name":{"constant_value":"public_sg"},"vpc_id":{"references":["aws_vpc.mtc_vpc.id","aws_vpc.mtc_vpc"]}},"schema_version":1},{"address":"aws_subnet.mtc_public_subnet","mode":"managed","type":"aws_subnet","name":"mtc_public_subnet","provider_config_key":"aws","expressions":{"cidr_block":{"constant_value":"10.123.1.0/24"},"map_public_ip_on_launch":{"constant_value":true},"tags":{"constant_value":{"Name":"dev-public"}},"vpc_id":{"references":["aws_vpc.mtc_vpc.id","aws_vpc.mtc_vpc"]}},"schema_version":1},{"address":"aws_vpc.mtc_vpc","mode":"managed","type":"aws_vpc","name":"mtc_vpc","provider_config_key":"aws","expressions":{"cidr_block":{"constant_value":"10.123.0.0/16"},"enable_dns_hostnames":{"constant_value":true},"enable_dns_support":{"constant_value":true},"tags":{"constant_value":{"Name":"dev2"}}},"schema_version":1},{"address":"data.aws_ami.server_ami","mode":"data","type":"aws_ami","name":"server_ami","provider_config_key":"aws","expressions":{"filter":[{"name":{"constant_value":"name"},"values":{"constant_value":["ubuntu/images/hvm-ssd/ubuntu-bionic-18.04-amd64-server-*"]}}],"most_recent":{"constant_value":true},"owners":{"constant_value":["099720109477"]}},"schema_version":0}],"variables":{"host_os":{"default":"windows"}}}},"relevant_attributes":[{"resource":"aws_subnet.mtc_public_subnet","attribute":["id"]},{"resource":"aws_internet_gateway.mtc_internet_gateway","attribute":["id"]},{"resource":"aws_security_group.mtc_sg","attribute":["id"]},{"resource":"data.aws_ami.server_ami","attribute":["id"]},{"resource":"aws_key_pair.mtc_auth","attribute":["id"]},{"resource":"aws_instance.dev_node","attribute":["public_ip"]},{"resource":"aws_vpc.mtc_vpc","attribute":["id"]},{"resource":"aws_route_table.mtc_public_rt","attribute":["id"]}],"timestamp":"2023-12-18T22:22:09Z"}
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Changes are GO
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Uploading the list of managed resources...
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Please be aware that the run changes calculation includes output changes.
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Resource list upload is GO
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Generating JSON representation of the plan...
[01HGDN76QHK92ZDA5ZBYGSGJQZ] JSON representation is GO
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Loading custom plan policy inputs...
[01HGDN76QHK92ZDA5ZBYGSGJQZ] 0 custom plan policy inputs found
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Evaluated 1 plan policy
[01HGDN76QHK92ZDA5ZBYGSGJQZ] Plan checks are GO